from transformers import AutoTokenizer

def token_count():
    tokenizer = AutoTokenizer.from_pretrained("BAAI/bge-m3")
    
    text = """ขั้นตอนการลงทะเบียนเรียน
1. เข้าสู่ระบบ https://reg.su.ac.th
2. คลิกเมนู "ลงทะเบียน" เพื่อเข้าสู่หน้าจอลงทะเบียน โดยเมนูนี้จะปรากฏในช่วงลงทะเบียนเท่านั้น
3. กรุณาอ่านเงื่อนไขการลงทะเบียน จากนั้นคลิกปุ่ม "ยอมรับเงื่อนไข"
4. เข้าสู่หน้าจอเลือกรายวิชาลงทะเบียน 
4.1 ระบุรหัสรายวิชา และค้นหาข้อมูลรายวิชาเปิด ที่ต้องการเลือกลงทะเบียน
4.2 ระบบแสดงรายวิชาตามที่ระบุในขั้นตอนที่ 4 โดยรายวิชาที่นักศึกษาได้รับสิทธิ์ในการ
ลงทะเบียนจะแสดงปุ่ม "เลือก" ด้านหน้ารายวิชา คลิกปุ่ม "เลือก" หากต้องการลงทะเบียน ระบบ
จะนำรายวิชาดังกล่าวไปแสดงในพื้นที่ "รายวิชาที่ต้องการลงทะเบียน" ให้โดยอัตโนมัติ
***กรณีที่รายวิชาที่นักศึกษาเลือกลงทะเบียนเรียนที่ไม่อยู่ในโครงสร้างหลักสูตรของนักศึกษารายวิชานั้นจะเป็นการลงทะเบียนวิชาเลือกเสรี
4.3 คลิกที่ "ปุ่มติ๊กถูก AU" ที่แสดงอยู่ท้ายรายวิชา หากต้องการลงทะเบียนแบบได้รับเกรด AU
4.4 สามารถคลิกปุ่ม "ลบวิชา" ในรายวิชาที่ไม่ต้องการลงทะเบียนได้
4.5 คลิกปุ่ม "ตรวจสอบ" เพื่อตรวจสอบการติดเงื่อนไขลงทะเบียน
***กรณีรายวิชาลงทะเบียนไม่เป็นไปตามเงื่อนไขที่มหาวิทยาลัยฯ เช่น จำนวนหน่วยกิต
ลงทะเบียนมากกว่าเกณฑ์/น้อยกว่าเกณฑ์, ตารางเรียนซ้ำซ้อน ฯลฯ จะมีข้อความแจ้งเตือนและ
ไม่สามารถคลิกปุ่มตรวจสอบและยืนยันการลงทะเบียนได้
5. เข้าสู่หน้าจอตรวจสอบ และยืนยันการลงทะเบียน
5.1 นักศึกษาควรตรวจสอบข้อมูล ก่อนคลิกปุ่ม "ยืนยันการลงทะเบียน" ประกอบด้วย 
- ข้อมูลรายวิชา กลุ่มเรียน และวันเวลาเรียน/เวลาสอบ
- ข้อมูลรายการค่าใช้จ่ายที่เกิดจากการลงทะเบียน
- ข้อมูลตารางเรียนในรูปแบบของตาราง
5.2 จากนั้นให้คลิกปุ่ม "ยืนยันการลงทะเบียน"
6. เมื่อคลิกยืนยันลงทะเบียน เป็นอันเสร็จสิ้นกระบวนการลงทะเบียน
6.1 ให้นักศึกษาคลิก ปุ่ม "ผลการลงทะเบียน" เพื่อเข้าสู่หน้าจอผลการลงทะเบียนและพิมพ์ใบแจ้งการชำระเงินค่าลงทะเบียน
7. คลิกปุ่ม "ใบแจ้งบอดชำระเงิน" เพื่อชำระเงินที่ธนาคาร หรือคลิก "ชำระเงินออนไลน์" เพื่อชำระเงินออนไลน์ได้"""
    
    tokens = tokenizer.encode(text)
    print("Token count:", len(tokens))
    # print("Tokens:", tokens)
    # print("Decoded:", tokenizer.decode(tokens))

# token_count()